# Kaggle - Titanic Tutorial - 0.76
그동안 배운 판다스를 활용하여 타이타닉 생존자를 예측해봅시다!

## 라이브러리 불러오기

In [1]:
# 데이터 분석 관련

import pandas as pd
import numpy as np

# 머신러닝 모델 학습 관련
from sklearn.linear_model import LogisticRegression

------

## 데이터 읽기

In [2]:
train_df = pd.read_csv("./data/train.csv")
test_df = pd.read_csv("./data/test.csv")

In [3]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
train_df.info()
print("\n", "="*40, "\n")
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

 ========================================

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

--------

## 데이터 처리

### 1. PassengerID

In [6]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### train 데이터에서 PassengerID drop

In [7]:
# drop
train_df.drop("PassengerId", axis=1, inplace=True)
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 2. Pclass

#### null 값 확인

In [8]:
# isnull()
sum(train_df["Pclass"].isnull()), sum(test_df["Pclass"].isnull())

(0, 0)

#### 정수형 -> 범주형 형변환

In [9]:
# value_counts()
print(sum(train_df["Pclass"].value_counts()))
train_df["Pclass"].value_counts()

891

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [10]:
print(sum(test_df["Pclass"].value_counts()))
test_df["Pclass"].value_counts()

418

3    218
1    107
2     93
Name: Pclass, dtype: int64

In [11]:
# astype
train_df["Pclass"] = train_df["Pclass"].astype("category")
test_df["Pclass"] = test_df["Pclass"].astype("category")

In [12]:
train_df["Pclass"].head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: category
Categories (3, int64): [1, 2, 3]

#### one-hot encoding / dummy

In [13]:
#get_dummies
train_pclass_dummies = pd.get_dummies(train_df["Pclass"], prefix="pclass")
test_pclass_dummies = pd.get_dummies(test_df["Pclass"], prefix="pclass")

In [14]:
train_pclass_dummies.head()

   pclass_1  pclass_2  pclass_3
0         0         0         1
1         1         0         0
2         0         0         1
3         1         0         0
4         0         0         1

In [15]:
# df 에 dummies 추가
train_df[train_pclass_dummies.columns] = train_pclass_dummies
test_df[test_pclass_dummies.columns] = test_pclass_dummies

In [16]:
print(train_df.shape)
train_df.head()

(891, 14)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,pclass_1,pclass_2,pclass_3
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,0,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,1
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,0,0
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,1

In [17]:
# Pclass drop
train_df.drop("Pclass", axis=1, inplace=True)
test_df.drop("Pclass", axis=1, inplace=True)
train_df.shape

(891, 13)

### 3. Name

#### Name drop

In [18]:
# drop
train_df.drop("Name", axis=1, inplace=True)
test_df.drop("Name", axis=1, inplace=True)

print(train_df.shape)
train_df.head()

(891, 12)

,Survived,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,pclass_1,pclass_2,pclass_3
0,0,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1
1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,1,0,0
2,1,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,1
3,1,female,35.0,1,0,113803,53.1000,C123,S,1,0,0
4,0,male,35.0,0,0,373450,8.0500,NaN,S,0,0,1

### 4. Sex

#### null 값 확인

In [19]:
# isnull()
sum(train_df["Sex"].isnull()), sum(test_df["Sex"].isnull())

(0, 0)

#### one-hot encoding / dummy

In [20]:
train_sex_dummies = pd.get_dummies(train_df["Sex"])
test_sex_dummies = pd.get_dummies(test_df["Sex"])

train_df[train_sex_dummies.columns] = train_sex_dummies
test_df[test_sex_dummies.columns] = test_sex_dummies

train_df.drop("Sex", axis=1, inplace=True)
test_df.drop("Sex", axis=1, inplace=True)

print(train_df.shape)
train_df.head()

(891, 13)

,Survived,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,pclass_1,pclass_2,pclass_3,female,male
0,0,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1,0,1
1,1,38.0,1,0,PC 17599,71.2833,C85,C,1,0,0,1,0
2,1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,1,1,0
3,1,35.0,1,0,113803,53.1000,C123,S,1,0,0,1,0
4,0,35.0,0,0,373450,8.0500,NaN,S,0,0,1,0,1

### 4. Age

#### null 값 확인

In [21]:
# isnull()
sum(train_df["Age"].isnull()), sum(test_df["Age"].isnull())

(177, 86)

#### 평균값으로 null 값 대체

In [22]:
train_df["Age"].fillna(train_df["Age"].mean(), inplace=True)
test_df["Age"].fillna(train_df["Age"].mean(), inplace=True)

sum(train_df["Age"].isnull()), sum(test_df["Age"].isnull())

(0, 0)

### 5. SibSp

#### null 값 확인

In [23]:
# isnull()
sum(train_df["SibSp"].isnull()), sum(test_df["SibSp"].isnull())

(0, 0)

### 6. Parch

#### null 값 확인

In [24]:
# isnull()
sum(train_df["Parch"].isnull()), sum(test_df["Parch"].isnull())

(0, 0)

### 7. Ticket

#### drop - 처리는 추후에

In [25]:
train_df.drop("Ticket", axis=1, inplace=True)
test_df.drop("Ticket", axis=1, inplace=True)

print(train_df.shape)
train_df.head()

(891, 12)

,Survived,Age,SibSp,Parch,Fare,Cabin,Embarked,pclass_1,pclass_2,pclass_3,female,male
0,0,22.0,1,0,7.2500,NaN,S,0,0,1,0,1
1,1,38.0,1,0,71.2833,C85,C,1,0,0,1,0
2,1,26.0,0,0,7.9250,NaN,S,0,0,1,1,0
3,1,35.0,1,0,53.1000,C123,S,1,0,0,1,0
4,0,35.0,0,0,8.0500,NaN,S,0,0,1,0,1

### 8. Fare

#### null 값 확인

In [26]:
# isnull()
sum(train_df["Fare"].isnull()), sum(test_df["Fare"].isnull())

(0, 1)

#### 평균값으로 null 값 대체

In [27]:
train_df["Fare"].fillna(train_df["Fare"].mean(), inplace=True)
test_df["Fare"].fillna(train_df["Fare"].mean(), inplace=True)

sum(train_df["Fare"].isnull()), sum(test_df["Fare"].isnull())

(0, 0)

### 9. Cabin

#### drop - 처리는 추후에

In [28]:
train_df.drop("Cabin", axis=1, inplace=True)
test_df.drop("Cabin", axis=1, inplace=True)

print(train_df.shape)
train_df.head()

(891, 11)

,Survived,Age,SibSp,Parch,Fare,Embarked,pclass_1,pclass_2,pclass_3,female,male
0,0,22.0,1,0,7.2500,S,0,0,1,0,1
1,1,38.0,1,0,71.2833,C,1,0,0,1,0
2,1,26.0,0,0,7.9250,S,0,0,1,1,0
3,1,35.0,1,0,53.1000,S,1,0,0,1,0
4,0,35.0,0,0,8.0500,S,0,0,1,0,1

### 10. Embarked

#### null 값 확인

In [29]:
# isnull()
sum(train_df["Embarked"].isnull()), sum(test_df["Embarked"].isnull())

(2, 0)

#### 고유값 확인

In [30]:
# unique()
train_df["Embarked"].unique(), test_df["Embarked"].unique()

(array(['S', 'C', 'Q', nan], dtype=object),
 array(['Q', 'S', 'C'], dtype=object))

#### 최빈값으로 nan 값 대체

In [31]:
# replace() / 최빈값 메서드 : mode()
em_mode = train_df["Embarked"].mode()[0] # mode 값만 추출

train_df["Embarked"] = train_df["Embarked"].replace(np.nan, em_mode)
test_df["Embarked"] = train_df["Embarked"].replace(np.nan, em_mode)

sum(train_df["Embarked"].isnull()), sum(test_df["Embarked"].isnull())

(0, 0)

#### one-hot encoding / dummy

In [32]:
train_em_dummies = pd.get_dummies(train_df["Embarked"], prefix="embarked")
test_em_dummies = pd.get_dummies(test_df["Embarked"], prefix="embarked")

train_df[train_em_dummies.columns] = train_em_dummies
test_df[test_em_dummies.columns] = test_em_dummies

train_df.drop("Embarked", axis=1, inplace=True)
test_df.drop("Embarked", axis=1, inplace=True)

print(train_df.shape)
train_df.head()

(891, 13)

,Survived,Age,SibSp,Parch,Fare,pclass_1,pclass_2,pclass_3,female,male,embarked_C,embarked_Q,embarked_S
0,0,22.0,1,0,7.2500,0,0,1,0,1,0,0,1
1,1,38.0,1,0,71.2833,1,0,0,1,0,1,0,0
2,1,26.0,0,0,7.9250,0,0,1,1,0,0,0,1
3,1,35.0,1,0,53.1000,1,0,0,1,0,0,0,1
4,0,35.0,0,0,8.0500,0,0,1,0,1,0,0,1

----------

## 모델 학습

### 1. 데이터 분할

In [33]:
train_x = train_df.drop("Survived", axis=1)
train_y = train_df["Survived"]
test_x = test_df.drop("PassengerId", axis=1)

train_x.shape, train_y.shape, test_x.shape

((891, 12), (891,), (418, 12))

### 2. 모델 생성 및 학습

#### train 데이터 학습

In [34]:
# LogisticRegression 클래스 생성
# fit()
lr = LogisticRegression()
lr.fit(train_x, train_y)

/Users/yehoon/opt/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/_logistic.py:765: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression()

#### test 데이터 예측

In [35]:
# predeict()
y_predict = lr.predict(test_x)

### 3. 제출용 파일 만들기

In [36]:
titanic_sub = pd.DataFrame({"PassengerId": test_df["PassengerId"], "Survived":y_predict})
titanic_sub.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [37]:
titanic_sub.to_csv("./submission/titanic.csv", index=False)